<script setup lang="ts">
// TODO: Update ToS Page style
import { VaDivider } from "vuestic-ui";
import { backToTop } from "@/composables/utils";
backToTop();
</script>

<template>
  <div class="mt-8 mb-8 m-auto w-11/12">
    <div class="text-4xl text-neutral-100 text-center mt-4">使用條款</div>
    <VaDivider />
    <div class="mt-4 mb-6 text-2xl">
      本聲明是為規範網際網路連接視聽閱覽者（下稱「本站閱聽人」）存取水星伺服器官網（下稱「本站」）所提供之多媒體內容，包括但不限於：文字、文件、圖片、影音、壓縮檔與外部連結，所應有之權利與應盡之義務，以及規範本站閱聽人與本站之管理者之權利義務關係。
    </div>
    <ol>
      <li>
        <!-- 1. -->
        本站之管理者（下稱「本站管理方」），若未經正常程序變更，為水星伺服器管理委員會。
        <ol>
          <li>
            <!-- 1.1. -->
            本站管理權之歸屬，若未經正常程序變更，為本站管理方持有。
          </li>
        </ol>
      </li>
      <li>
        <!-- 2. -->
        本站所提供之資訊為關於水星伺服器之簡介、一切事務、公告、規範與開放下載資源，著作權由本站管理方持有。
      </li>
      <li>
        <!-- 3. -->
        本站管理方雖有維持所提供之資訊最新與健康之義務，但本站閱聽人瀏覽時應自行留意公告日期、內容與其後更新狀況，所有資訊之引用與依據均依存取時可取得之最新資訊為準。
      </li>
      <ol>
        <li>
          <!-- 3.1. -->
          引用、傳閱、翻攝本網站提供之資訊、規範與標準並與內容互動的同時，本站閱聽人受隱私政策、使用條款之規範，未經本站管理方同意，不得擅自變更其部分或全部內容。
        </li>
        <li>
          <!-- 3.2. -->
          本站並不保證本站視聽人於本站可獲得之訊息為100%正確，並不為本站視聽人分享這些訊息時，因資訊更新、傳輸延遲或系統故障等「不可歸責於本站管理方之因素」產生之資訊落差負責。
        </li>
      </ol>
      <li>
        <!-- 4. -->
        本站所提供之開放下載檔案，著作權由本站管理方持有。
      </li>
      <ol>
        <li>
          <!-- 4.1. -->
          本站管理方雖有維持檔案最新與健康之義務，但本站閱聽人下載時應自行留意檔案版本與其後更新狀況，所有資訊之引用與依據均依存取時可取得之最新資訊為準。
        </li>
        <li>
          <!-- 4.2. -->
          下載本站檔案或瀏覽本站提供之外部連結時，本站閱聽人應自行留意檔案安全與網路資通隱私權等，若檔案或連結因夾帶病毒而導致使用者電腦遭植入第三方木馬程式、竊取資料或資料完整性遭損害等任何損失，本站
          <div class="inline text-red-500 font-bold text-2xl">
            完全不負任何責任
          </div>
          。
        </li>
        <li>
          <!-- 4.3. -->
          引用、傳閱、翻攝本網站提供之開放下載資源、瀏覽本網站提供之外部連結並與其內容互動的同時，本站閱聽人受使用條款之規範，未經本站管理方同意，不得擅自變更其部分或全部內容。
        </li>
        <li>
          <!-- 4.4. -->
          本站並不保證本站視聽人於本站可下載之資源為100%正確，並不為本站視聽人分享這些資源時，因資訊更新、傳輸延遲或系統故障等「不可歸責於本站管理方之因素」產生之資訊落差負責。
        </li>
      </ol>
      <li>
        本聲明若有任何未盡之處，本站管理方保留在任何時間，不經告知的情況下隨時更新本聲明內容，本站閱聽人應自行留意本聲明內容是否為最新版本，並應恪遵所有條款之規定。
      </li>
    </ol>
    <div class="text-4xl text-neutral-100 text-center mt-8">補充條款</div>
    <VaDivider />
    <div>
      <div class="mt-4 mb-6 text-2xl">一、條款之契約效力</div>
      <div>
        本站閱聽人一經進入、瀏覽或使用本網站，即視為已詳閱、理解並同意本使用條款及相關政策（包含但不限於隱私政策、著作權聲明等），並與本站管理方成立具有法律效力之契約關係。若不同意本條款內容，請立即停止使用本網站。
      </div>
      <div class="mt-4 mb-6 text-2xl">二、責任限制與合理注意義務聲明</div>
      <div>
        本站管理方已盡合理努力確保本網站所提供資訊與資源之正確性、安全性與完整性，惟不保證其完全無誤或不中斷運作。對於因使用本網站、下載資源或連結第三方網站所生之任何直接、間接、附帶、特殊或衍生性損害，本站管理方概不負責，除非可證明係由本站管理方之重大過失或故意所致。
      </div>
      <div class="mt-4 mb-6 text-2xl">三、個人資料與隱私政策</div>
      <div>
        本站可能於您瀏覽本網站期間收集必要之技術性資訊（如 IP位址、裝置資訊與
        Cookie等），僅作為網站安全與內容優化用途，本站將依據中華民國《個人資料保護法》等相關法規妥善處理所有個人資料。如欲了解更多資訊，請參閱本站「隱私政策」。
      </div>
      <div class="mt-4 mb-6 text-2xl">四、準據法與管轄法院</div>
      <div>
        本使用條款之成立、解釋與適用，均以中華民國法律為準據法。如因使用本網站而產生任何爭議，雙方同意以臺灣臺北地方法院為第一審專屬管轄法院。
      </div>
    </div>
  </div>
</template>

<style>
ol li {
  list-style: decimal;
  list-style-position: inside;
}

ol ol li {
  margin-left: 40px;
}
</style>
