<script setup lang="ts">
</script>

<template>
<div>
    本聲明是為規範網際網路連接視聽閱覽者（下稱本站閱聽人）存取水星伺服器官網（下稱本站）所提供之多媒體內容，包括但不限於：文字、文件、圖片、影音、壓縮檔與外部連結，所應有之權利與應盡之義務，以及規範本站閱聽人與本站之管理者之權利義務關係。


本站之管理者（下稱本站管理方），若未經正常程序變更，為水星伺服器管理委員會。

本站管理權之歸屬，若未經正常程序變更，為本站管理方持有。


本站所提供之資訊為關於水星伺服器之簡介、一切事務、公告、規範與開放下載資源，著作權由本站管理方持有。

本站管理方雖有維持所提供之資訊最新與健康之義務，但本站閱聽人瀏覽時應自行留意公告日期、內容與其後更新狀況，所有資訊之引用與依據均依存取時可取得之最新資訊為準。

引用、傳閱、翻攝本網站提供之資訊、規範與標準並與內容互動的同時，本站閱聽人受隱私權政策、使用條款之規範，未經本站管理方同意，不得擅自變更其部分或全部內容。

本站並不保證本站視聽人於本站可獲得之訊息為100%正確，並不為本站視聽人分享這些訊息時，因資訊更新、傳輸延遲或系統故障等「不可歸責於本站管理方之因素」產生之資訊落差負責。


本站所提供之開放下載資源檔案，著作權由本站管理方持有。

本站管理方雖有維持檔案最新與健康之義務，但本站閱聽人下載時應自行留意檔案版本與其後更新狀況，所有資訊之引用與依據均依存取時可取得之最新資訊為準。

下載本站檔案或瀏覽本站提供之外部連結時，本站閱聽人應自行留意檔案安全與網路資通隱私權等，若檔案或連結因夾帶病毒而導致使用者電腦遭植入第三方木馬程式、竊取資料或資料完整性遭損害等任何損失，本站完全不負任何責任。

引用、傳閱、翻攝本網站提供之開放下載資源、瀏覽本網站提供之外部連結並與其內容互動的同時，本站閱聽人受使用條款之規範，未經本站管理方同意，不得擅自變更其部分或全部內容。

本站並不保證本站視聽人於本站可下載之資源為100%正確，並不為本站視聽人分享這些資源時，因資訊更新、傳輸延遲或系統故障等「不可歸責於本站管理方之因素」產生之資訊落差負責。


本聲明若與隱私權政策、使用條款等上級規範條例有衝突，以本站管理方解釋為最終依據與執行方向。


本聲明若有任何未盡之處，本站管理方保留在任何時間，不經告知的情況下隨時更新本聲明內容，本站閱聽人應自行留意本聲明內容是否為最新版本，並應恪遵所有條款之規定。
</div>
</template>